## 🏗️ Terraform Plan for 
<details>
<summary>Click to expand plan</summary>
```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs_service.aws_ecs_service.main will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:us-east-1:908027381725:service/general-cluster/gpt-researcher-prod-service"
        name                               = "gpt-researcher-prod-service"
        tags                               = {
            "CloudMapNamespace"   = "ggai"
            "CloudMapServiceName" = "gpt-researcher"
            "CreatedBy"           = "terraform"
            "Environment"         = "prod"
            "ManagedBy"           = "terraform"
            "Module"              = "ecs-service"
            "Name"                = "gpt-researcher-prod-service"
            "Project"             = "gpt-researcher"
            "Service"             = "gpt-researcher"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:908027381725:task-definition/gpt-researcher-prod-task-def:2" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.main must be replaced
-/+ resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-east-1:908027381725:task-definition/gpt-researcher-prod-task-def:2" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:908027381725:task-definition/gpt-researcher-prod-task-def" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image            = "908027381725.dkr.ecr.us-east-1.amazonaws.com/gpt-researcher:v1.0.5" -> "908027381725.dkr.ecr.us-east-1.amazonaws.com/gpt-researcher:latest"
                    name             = "gpt-researcher"
                  ~ portMappings     = [
                      ~ {
                          - hostPort      = 3535
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                    # (6 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "gpt-researcher-prod-task-def" -> (known after apply)
      ~ revision                 = 2 -> (known after apply)
        tags                     = {
            "CloudMapNamespace"   = "ggai"
            "CloudMapServiceName" = "gpt-researcher"
            "CreatedBy"           = "terraform"
            "Environment"         = "prod"
            "ManagedBy"           = "terraform"
            "Module"              = "ecs-service"
            "Name"                = "gpt-researcher-prod-task-def"
            "Project"             = "gpt-researcher"
            "Service"             = "gpt-researcher"
        }
        # (10 unchanged attributes hidden)

      - volume {
          - configure_at_launch = false -> null
          - name                = "pipelines" -> null

          - efs_volume_configuration {
              - file_system_id          = "fs-09c4afb9c80f325a1" -> null
              - root_directory          = "/" -> null
              - transit_encryption      = "ENABLED" -> null
              - transit_encryption_port = 0 -> null

              - authorization_config {
                  - access_point_id = "fsap-0c36252f7b9e45d71" -> null
                }
            }
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "pipelines"

          + efs_volume_configuration {
              + file_system_id          = "fs-09c4afb9c80f325a1"
              + root_directory          = "/"
              + transit_encryption      = "ENABLED"
              + transit_encryption_port = 0

              + authorization_config {
                  + access_point_id = "fsap-0c36252f7b9e45d71"
                }
            }
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ deployment_summary         = {
      ~ image_tag             = "v1.0.5" -> "latest"
        # (9 unchanged attributes hidden)
    }
  ~ task_definition_arn        = "arn:aws:ecs:us-east-1:908027381725:task-definition/gpt-researcher-prod-task-def:2" -> (known after apply)

```
</details>
**Plan Status:** success
**Service:** .ggai:8000
